corhaneanusergiu/atmega328p-optiboot-various-62/atmega328p/avr/boards.txt
name=[Gert Sanders boards]
version=1.1

menu.mhz=CPU frequency, upload speed, LED
menu.oscillator=Clock source
menu.bod=Brown Out Detection

############################################################################
# possible upload speeds: 9600, 14400, 19200, 28800, 38400, 57600, or 115200
############################################################################

28PinBoard.name=atmega328p based - 28 pin DIL

28PinBoard.upload.tool=arduino:avrdude
28PinBoard.upload.protocol=arduino
28PinBoard.upload.maximum_size=32256
28PinBoard.upload.maximum_data_size=2048

28PinBoard.bootloader.tool=arduino:avrdude
28PinBoard.bootloader.unlock_bits=0x3F
28PinBoard.bootloader.lock_bits=0x0F
28PinBoard.bootloader.high_fuses=0xDE

28PinBoard.build.core=arduino:arduino
28PinBoard.build.mcu=atmega328p
28PinBoard.build.board=AVR_GERTSANDERS28PinBoard
28PinBoard.build.variant=28PinBoard


28PinBoard.menu.oscillator.8MHzCDIV8=1Mhz - internal 8MHz CDIV 8
28PinBoard.menu.oscillator.8MHzCDIV8.bootloader.low_fuses=0x62

28PinBoard.menu.oscillator.Internal=8MHz - internal oscillator
28PinBoard.menu.oscillator.Internal.bootloader.low_fuses=0xE2

28PinBoard.menu.oscillator.FULLSWING=Full swing crystal
28PinBoard.menu.oscillator.FULLSWING.bootloader.low_fuses=0xFF

28PinBoard.menu.bod.4v3=4V3
28PinBoard.menu.bod.4v3.bootloader.extended_fuses=0x04

28PinBoard.menu.bod.2v7=2V7
28PinBoard.menu.bod.2v7.bootloader.extended_fuses=0x05

28PinBoard.menu.bod.1v8=1V8
28PinBoard.menu.bod.1v8.bootloader.extended_fuses=0x06

28PinBoard.menu.bod.off=Disabled
28PinBoard.menu.bod.off.bootloader.extended_fuses=0x07




28PinBoard.menu.mhz.1M-4K8-NL=1Mhz - 4K8 - NO LED
28PinBoard.menu.mhz.1M-4K8-NL.build.f_cpu=1000000L
28PinBoard.menu.mhz.1M-4K8-NL.upload.speed=4800
28PinBoard.menu.mhz.1M-4K8-NL.bootloader.file=myoptiboot/optiboot_atmega328_01M_004800_NOLED.hex

28PinBoard.menu.mhz.1M-4K8-D5=1Mhz - 4K8 - D5
28PinBoard.menu.mhz.1M-4K8-D5.build.f_cpu=1000000L
28PinBoard.menu.mhz.1M-4K8-D5.upload.speed=4800
28PinBoard.menu.mhz.1M-4K8-D5.bootloader.file=myoptiboot/optiboot_atmega328_01M_004800_D5.hex

28PinBoard.menu.mhz.1M-4K8-D8=1Mhz - 4K8 - D8
28PinBoard.menu.mhz.1M-4K8-D8.build.f_cpu=1000000L
28PinBoard.menu.mhz.1M-4K8-D8.upload.speed=4800
28PinBoard.menu.mhz.1M-4K8-D8.bootloader.file=myoptiboot/optiboot_atmega328_01M_004800_D8.hex

28PinBoard.menu.mhz.1M-4K8-D13=1Mhz - 4K8 - D13
28PinBoard.menu.mhz.1M-4K8-D13.build.f_cpu=1000000L
28PinBoard.menu.mhz.1M-4K8-D13.upload.speed=4800
28PinBoard.menu.mhz.1M-4K8-D13.bootloader.file=myoptiboot/optiboot_atmega328_01M_004800_D13.hex



28PinBoard.menu.mhz.1M-9K6-D5=1Mhz - 9K6 - D5
28PinBoard.menu.mhz.1M-9K6-D5.build.f_cpu=1000000L
28PinBoard.menu.mhz.1M-9K6-D5.upload.speed=9600
28PinBoard.menu.mhz.1M-9K6-D5.bootloader.file=myoptiboot/optiboot_atmega328_01M_009600_D5.hex

28PinBoard.menu.mhz.1M-9K6-D8=1Mhz - 9K6 - D8
28PinBoard.menu.mhz.1M-9K6-D8.build.f_cpu=1000000L
28PinBoard.menu.mhz.1M-9K6-D8.upload.speed=9600
28PinBoard.menu.mhz.1M-9K6-D8.bootloader.file=myoptiboot/optiboot_atmega328_01M_009600_D8.hex

28PinBoard.menu.mhz.1M-9K6-D13=1Mhz - 9K6 - D13
28PinBoard.menu.mhz.1M-9K6-D13.build.f_cpu=1000000L
28PinBoard.menu.mhz.1M-9K6-D13.upload.speed=9600
28PinBoard.menu.mhz.1M-9K6-D13.bootloader.file=myoptiboot/optiboot_atmega328_01M_009600_D13.hex



28PinBoard.menu.mhz.4M-19K2-NL=4Mhz - 19K2 - NO LED
28PinBoard.menu.mhz.4M-19K2-NL.build.f_cpu=4000000L
28PinBoard.menu.mhz.4M-19K2-NL.upload.speed=19200
28PinBoard.menu.mhz.4M-19K2-NL.bootloader.file=myoptiboot/optiboot_atmega328_04M_019200_NOLED.hex

28PinBoard.menu.mhz.4M-19K2-D8=4Mhz - 19K2 - D8
28PinBoard.menu.mhz.4M-19K2-D8.build.f_cpu=4000000L
28PinBoard.menu.mhz.4M-19K2-D8.upload.speed=19200
28PinBoard.menu.mhz.4M-19K2-D8.bootloader.file=myoptiboot/optiboot_atmega328_04M_019200_D8.hex



28PinBoard.menu.mhz.8M-9K6-D8=8Mhz - 9K6 - D8
28PinBoard.menu.mhz.8M-9K6-D8.build.f_cpu=8000000L
28PinBoard.menu.mhz.8M-9K6-D8.upload.speed=9600
28PinBoard.menu.mhz.8M-9K6-D8.bootloader.file=myoptiboot/optiboot_atmega328_08M_009600_D8.hex



28PinBoard.menu.mhz.8M-38K4-NL=8Mhz - 38K4 - NO LED
28PinBoard.menu.mhz.8M-38K4-NL.build.f_cpu=8000000L
28PinBoard.menu.mhz.8M-38K4-NL.upload.speed=38400
28PinBoard.menu.mhz.8M-38K4-NL.bootloader.file=myoptiboot/optiboot_atmega328_08M_038400_NOLED.hex

28PinBoard.menu.mhz.8M-38K4-D5=8Mhz - 38K4 - D5
28PinBoard.menu.mhz.8M-38K4-D5.build.f_cpu=8000000L
28PinBoard.menu.mhz.8M-38K4-D5.upload.speed=38400
28PinBoard.menu.mhz.8M-38K4-D5.bootloader.file=myoptiboot/optiboot_atmega328_08M_038400_D5.hex

28PinBoard.menu.mhz.8M-38K4-D6=8Mhz - 38K4 - D6
28PinBoard.menu.mhz.8M-38K4-D6.build.f_cpu=8000000L 
28PinBoard.menu.mhz.8M-38K4-D6.upload.speed=38400
28PinBoard.menu.mhz.8M-38K4-D6.bootloader.file=myoptiboot/optiboot_atmega328_08M_038400_D6.hex

28PinBoard.menu.mhz.8M-38K4-D8=8Mhz - 38K4 - D8
28PinBoard.menu.mhz.8M-38K4-D8.build.f_cpu=8000000L 
28PinBoard.menu.mhz.8M-38K4-D8.upload.speed=38400
28PinBoard.menu.mhz.8M-38K4-D8.bootloader.file=myoptiboot/optiboot_atmega328_08M_038400_D8.hex

28PinBoard.menu.mhz.8M-38K4-D13=8Mhz - 38K4 - D13
28PinBoard.menu.mhz.8M-38K4-D13.build.f_cpu=8000000L 
28PinBoard.menu.mhz.8M-38K4-D13.upload.speed=38400
28PinBoard.menu.mhz.8M-38K4-D13.bootloader.file=myoptiboot/optiboot_atmega328_08M_038400_D13.hex



28PinBoard.menu.mhz.16M-57K-NL=16Mhz - 57K6 - NO LED
28PinBoard.menu.mhz.16M-57K-NL.build.f_cpu=16000000L
28PinBoard.menu.mhz.16M-57K-NL.upload.speed=57600
28PinBoard.menu.mhz.16M-57K-NL.bootloader.file=myoptiboot/optiboot_atmega328_16M_057600_NOLED.hex

28PinBoard.menu.mhz.16M-57K-D5=16Mhz - 57K6 - D5
28PinBoard.menu.mhz.16M-57K-D5.build.f_cpu=16000000L
28PinBoard.menu.mhz.16M-57K-D5.upload.speed=57600
28PinBoard.menu.mhz.16M-57K-D5.bootloader.file=myoptiboot/optiboot_atmega328_16M_057600_D5.hex

28PinBoard.menu.mhz.16M-57K-D8=16Mhz - 57K6 - D8
28PinBoard.menu.mhz.16M-57K-D8.build.f_cpu=16000000L
28PinBoard.menu.mhz.16M-57K-D8.upload.speed=57600
28PinBoard.menu.mhz.16M-57K-D8.bootloader.file=myoptiboot/optiboot_atmega328_16M_057600_D8.hex

28PinBoard.menu.mhz.16M-57K-D13=16Mhz - 57K6 - D13
28PinBoard.menu.mhz.16M-57K-D13.build.f_cpu=16000000L
28PinBoard.menu.mhz.16M-57K-D13.upload.speed=57600
28PinBoard.menu.mhz.16M-57K-D13.bootloader.file=myoptiboot/optiboot_atmega328_16M_057600_D13.hex



28PinBoard.menu.mhz.16M-74K-D8=16Mhz - 74K8 - D8
28PinBoard.menu.mhz.16M-74K-D8.build.f_cpu=16000000L
28PinBoard.menu.mhz.16M-74K-D8.upload.speed=74880 
28PinBoard.menu.mhz.16M-74K-D8.bootloader.file=myoptiboot/optiboot_atmega328_16M_074880_D8.hex


28PinBoard.menu.mhz.16M-76K-D8=16Mhz - 76K8 - D8
28PinBoard.menu.mhz.16M-76K-D8.build.f_cpu=16000000L
28PinBoard.menu.mhz.16M-76K-D8.upload.speed=76800 
28PinBoard.menu.mhz.16M-76K-D8.bootloader.file=myoptiboot/optiboot_atmega328_16M_076800_D8.hex


28PinBoard.menu.mhz.16M-115K-D8=16Mhz - 115K2 - D8
28PinBoard.menu.mhz.16M-115K-D8.build.f_cpu=16000000L
28PinBoard.menu.mhz.16M-115K-D8.upload.speed=115200 
28PinBoard.menu.mhz.16M-115K-D8.bootloader.file=myoptiboot/optiboot_atmega328_16M_115200_D8.hex

28PinBoard.menu.mhz.16M-115K-D13=16Mhz - 115K2 - D13
28PinBoard.menu.mhz.16M-115K-D13.build.f_cpu=16000000L
28PinBoard.menu.mhz.16M-115K-D13.upload.speed=115200 
28PinBoard.menu.mhz.16M-115K-D13.bootloader.file=myoptiboot/optiboot_atmega328_16M_115200_D13.hex



