corhaneanusergiu/atmega328p-optiboot-various-62/atmega328p/avr/boards.txt
28PinBoard.menu.mhz.16M-230K-D8=16Mhz - 230K4 - D8
28PinBoard.menu.mhz.16M-230K-D8.build.f_cpu=16000000L
28PinBoard.menu.mhz.16M-230K-D8.upload.speed=230400 
28PinBoard.menu.mhz.16M-230K-D8.bootloader.file=myoptiboot/optiboot_atmega328_16M_230400_D8.hex


28PinBoard.menu.mhz.20M-115K-D8=20Mhz - 115K2 - D8
28PinBoard.menu.mhz.20M-115K-D8.build.f_cpu=20000000L
28PinBoard.menu.mhz.20M-115K-D8.upload.speed=115200 
28PinBoard.menu.mhz.20M-115K-D8.bootloader.file=myoptiboot/optiboot_atmega328_20M_115200_D8.hex


28PinBoard.menu.mhz.20M-230K-D8=20Mhz - 230K4 - D8
28PinBoard.menu.mhz.20M-230K-D8.build.f_cpu=20000000L
28PinBoard.menu.mhz.20M-230K-D8.upload.speed=230400 
28PinBoard.menu.mhz.20M-230K-D8.bootloader.file=myoptiboot/optiboot_atmega328_20M_230400_D8.hex


28PinBoard.menu.mhz.20M-250K-D8=20Mhz - 250K - D8
28PinBoard.menu.mhz.20M-250K-D8.build.f_cpu=20000000L
28PinBoard.menu.mhz.20M-250K-D8.upload.speed=250000 
28PinBoard.menu.mhz.20M-250K-D8.bootloader.file=myoptiboot/optiboot_atmega328_20M_250000_D8.hex



############################################################################



32PinBoard.name=atmega328p based - 32 pin TQFP

32PinBoard.upload.tool=arduino:avrdude
32PinBoard.upload.protocol=arduino
32PinBoard.upload.maximum_size=32256
32PinBoard.upload.maximum_data_size=2048

32PinBoard.bootloader.tool=arduino:avrdude

32PinBoard.bootloader.unlock_bits=0x3F
32PinBoard.bootloader.lock_bits=0x0F


32PinBoard.build.core=arduino:arduino
32PinBoard.build.mcu=atmega328p

32PinBoard.build.board=AVR_GERTSANDERS32PinBoard
32PinBoard.build.variant=32PinBoard

32PinBoard.menu.bod.4v3=4V3
32PinBoard.menu.bod.4v3.bootloader.extended_fuses=0x04
32PinBoard.menu.bod.2v7=2V7
32PinBoard.menu.bod.2v7.bootloader.extended_fuses=0x05
32PinBoard.menu.bod.1v8=1V8
32PinBoard.menu.bod.1v8.bootloader.extended_fuses=0x06
32PinBoard.menu.bod.off=Disabled
32PinBoard.menu.bod.off.bootloader.extended_fuses=0x07

32PinBoard.menu.mhz.8MiDIV8-4K8-NL= 1Mhz - internal 8MHz CDIV 8 - 4K8 - NO LED
32PinBoard.menu.mhz.8MiDIV8-4K8-NL.bootloader.low_fuses=0x62
32PinBoard.menu.mhz.8MiDIV8-4K8-NL.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8MiDIV8-4K8-NL.build.f_cpu=1000000L
32PinBoard.menu.mhz.8MiDIV8-4K8-NL.upload.speed=4800
32PinBoard.menu.mhz.8MiDIV8-4K8-NL.bootloader.file=myoptiboot/optiboot_atmega328_01M_004800_NOLED.hex


32PinBoard.menu.mhz.8MiDIV8-4K8-D5= 1Mhz - internal 8MHz CDIV 8 - 4K8 - D5
32PinBoard.menu.mhz.8MiDIV8-4K8-D5.bootloader.low_fuses=0x62
32PinBoard.menu.mhz.8MiDIV8-4K8-D5.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8MiDIV8-4K8-D5.build.f_cpu=1000000L
32PinBoard.menu.mhz.8MiDIV8-4K8-D5.upload.speed=4800
32PinBoard.menu.mhz.8MiDIV8-4K8-D5.bootloader.file=myoptiboot/optiboot_atmega328_01M_004800_D5.hex

32PinBoard.menu.mhz.8MiDIV8-4K8-D8= 1Mhz - internal 8MHz CDIV 8 - 4K8 - D8
32PinBoard.menu.mhz.8MiDIV8-4K8-D8.bootloader.low_fuses=0x62
32PinBoard.menu.mhz.8MiDIV8-4K8-D8.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8MiDIV8-4K8-D8.build.f_cpu=1000000L
32PinBoard.menu.mhz.8MiDIV8-4K8-D8.upload.speed=4800
32PinBoard.menu.mhz.8MiDIV8-4K8-D8.bootloader.file=myoptiboot/optiboot_atmega328_01M_004800_D8.hex

32PinBoard.menu.mhz.8MiDIV8-4K8-D13= 1Mhz - internal 8MHz CDIV 8 - 4K8 - D13
32PinBoard.menu.mhz.8MiDIV8-4K8-D13.bootloader.low_fuses=0x62
32PinBoard.menu.mhz.8MiDIV8-4K8-D13.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8MiDIV8-4K8-D13.build.f_cpu=1000000L
32PinBoard.menu.mhz.8MiDIV8-4K8-D13.upload.speed=4800
32PinBoard.menu.mhz.8MiDIV8-4K8-D13.bootloader.file=myoptiboot/optiboot_atmega328_01M_004800_D13.hex


32PinBoard.menu.mhz.8MiDIV8-9K6-D8= 1Mhz - internal 8MHz CDIV 8 - 9K6 - D8
32PinBoard.menu.mhz.8MiDIV8-9K6-D8.bootloader.low_fuses=0x62
32PinBoard.menu.mhz.8MiDIV8-9K6-D8.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8MiDIV8-9K6-D8.build.f_cpu=1000000L
32PinBoard.menu.mhz.8MiDIV8-9K6-D8.upload.speed=9600
32PinBoard.menu.mhz.8MiDIV8-9K6-D8.bootloader.file=myoptiboot/optiboot_atmega328_01M_009600_D8.hex

32PinBoard.menu.mhz.1M-9K6-D8= 1Mhz - crystal - 9K6 - D8
32PinBoard.menu.mhz.1M-9K6-D8.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.1M-9K6-D8.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.1M-9K6-D8.build.f_cpu=1000000L
32PinBoard.menu.mhz.1M-9K6-D8.upload.speed=9600
32PinBoard.menu.mhz.1M-9K6-D8.bootloader.file=myoptiboot/optiboot_atmega328_01M_009600_D8.hex


32PinBoard.menu.mhz.4M-19K2-D8= 4Mhz - crystal - 19K2 - D8
32PinBoard.menu.mhz.4M-19K2-D8.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.4M-19K2-D8.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.4M-19K2-D8.build.f_cpu=4000000L
32PinBoard.menu.mhz.4M-19K2-D8.upload.speed=19200
32PinBoard.menu.mhz.4M-19K2-D8.bootloader.file=myoptiboot/optiboot_atmega328_04M_019200_D8.hex

32PinBoard.menu.mhz.8Mi-9K6-D8= 8Mhz - internal - 9K6 - D8
32PinBoard.menu.mhz.8Mi-9K6-D8.bootloader.low_fuses=0xE2
32PinBoard.menu.mhz.8Mi-9K6-D8.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8Mi-9K6-D8.build.f_cpu=8000000L
32PinBoard.menu.mhz.8Mi-9K6-D8.upload.speed=9600
32PinBoard.menu.mhz.8Mi-9K6-D8.bootloader.file=myoptiboot/optiboot_atmega328_08M_009600_D8.hex

32PinBoard.menu.mhz.8Mi-38K4-D6= 8Mhz - internal - 38K4 - D6
32PinBoard.menu.mhz.8Mi-38K4-D6.bootloader.low_fuses=0xE2
32PinBoard.menu.mhz.8Mi-38K4-D6.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8Mi-38K4-D6.build.f_cpu=8000000L 
32PinBoard.menu.mhz.8Mi-38K4-D6.upload.speed=38400
32PinBoard.menu.mhz.8Mi-38K4-D6.bootloader.file=myoptiboot/optiboot_atmega328_08M_038400_D6.hex

32PinBoard.menu.mhz.8Mi-38K4-D8= 8Mhz - internal - 38K4 - D8
32PinBoard.menu.mhz.8Mi-38K4-D8.bootloader.low_fuses=0xE2
32PinBoard.menu.mhz.8Mi-38K4-D8.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8Mi-38K4-D8.build.f_cpu=8000000L 
32PinBoard.menu.mhz.8Mi-38K4-D8.upload.speed=38400
32PinBoard.menu.mhz.8Mi-38K4-D8.bootloader.file=myoptiboot/optiboot_atmega328_08M_038400_D8.hex

32PinBoard.menu.mhz.8Mi-38K4-D13= 8Mhz - internal - 38K4 - D13
32PinBoard.menu.mhz.8Mi-38K4-D13.bootloader.low_fuses=0xE2
32PinBoard.menu.mhz.8Mi-38K4-D13.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8Mi-38K4-D13.build.f_cpu=8000000L 
32PinBoard.menu.mhz.8Mi-38K4-D13.upload.speed=38400
32PinBoard.menu.mhz.8Mi-38K4-D13.bootloader.file=myoptiboot/optiboot_atmega328_08M_038400_D13.hex

32PinBoard.menu.mhz.8M-38K4-D5= 8Mhz - crystal - 38K4 - D5
32PinBoard.menu.mhz.8M-38K4-D5.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.8M-38K4-D5.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8M-38K4-D5.build.f_cpu=8000000L
32PinBoard.menu.mhz.8M-38K4-D5.upload.speed=38400
32PinBoard.menu.mhz.8M-38K4-D5.bootloader.file=myoptiboot/optiboot_atmega328_08M_038400_D5.hex

