corhaneanusergiu/atmega328p-optiboot-various-62/atmega328p/avr/boards.txt
32PinBoard.menu.mhz.8M-38K4-D6= 8Mhz - crystal - 38K4 - D6
32PinBoard.menu.mhz.8M-38K4-D6.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.8M-38K4-D6.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8M-38K4-D6.build.f_cpu=8000000L 
32PinBoard.menu.mhz.8M-38K4-D6.upload.speed=38400
32PinBoard.menu.mhz.8M-38K4-D6.bootloader.file=myoptiboot/optiboot_atmega328_08M_038400_D6.hex

32PinBoard.menu.mhz.8M-38K4-D8= 8Mhz - crystal - 38K4 - D8
32PinBoard.menu.mhz.8M-38K4-D8.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.8M-38K4-D8.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8M-38K4-D8.build.f_cpu=8000000L 
32PinBoard.menu.mhz.8M-38K4-D8.upload.speed=38400
32PinBoard.menu.mhz.8M-38K4-D8.bootloader.file=myoptiboot/optiboot_atmega328_08M_038400_D8.hex

32PinBoard.menu.mhz.8M-38K4-D13= 8Mhz - crystal - 38K4 - D13
32PinBoard.menu.mhz.8M-38K4-D13.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.8M-38K4-D13.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.8M-38K4-D13.build.f_cpu=8000000L 
32PinBoard.menu.mhz.8M-38K4-D13.upload.speed=38400
32PinBoard.menu.mhz.8M-38K4-D13.bootloader.file=myoptiboot/optiboot_atmega328_08M_038400_D13.hex

32PinBoard.menu.mhz.16M57=16Mhz - crystal - 57K6 - D8
32PinBoard.menu.mhz.16M57.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.16M57.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.16M57.build.f_cpu=16000000L
32PinBoard.menu.mhz.16M57.upload.speed=57600
32PinBoard.menu.mhz.16M57.bootloader.file=myoptiboot/optiboot_atmega328_16M_057600_D8.hex

32PinBoard.menu.mhz.16M-57K-D13=16Mhz - crystal - 57K6 - D13
32PinBoard.menu.mhz.16M-57K-D13.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.16M-57K-D13.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.16M-57K-D13.build.f_cpu=16000000L
32PinBoard.menu.mhz.16M-57K-D13.upload.speed=57600
32PinBoard.menu.mhz.16M-57K-D13.bootloader.file=myoptiboot/optiboot_atmega328_16M_057600_D13.hex

32PinBoard.menu.mhz.16M74=16Mhz - crystal - 74K8 - D8
32PinBoard.menu.mhz.16M74.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.16M74.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.16M74.build.f_cpu=16000000L
32PinBoard.menu.mhz.16M74.upload.speed=74880 
32PinBoard.menu.mhz.16M74.bootloader.file=myoptiboot/optiboot_atmega328_16M_074880_D8.hex

32PinBoard.menu.mhz.16M76=16Mhz - crystal - 76K8 - D8
32PinBoard.menu.mhz.16M76.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.16M76.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.16M76.build.f_cpu=16000000L
32PinBoard.menu.mhz.16M76.upload.speed=76800 
32PinBoard.menu.mhz.16M76.bootloader.file=myoptiboot/optiboot_atmega328_16M_076800_D8.hex

32PinBoard.menu.mhz.16M115=16Mhz - crystal - 115K2 - D8
32PinBoard.menu.mhz.16M115.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.16M115.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.16M115.build.f_cpu=16000000L
32PinBoard.menu.mhz.16M115.upload.speed=115200 
32PinBoard.menu.mhz.16M115.bootloader.file=myoptiboot/optiboot_atmega328_16M_115200_D8.hex

32PinBoard.menu.mhz.16M230=16Mhz - crystal - 230K4 - D8
32PinBoard.menu.mhz.16M230.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.16M230.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.16M230.build.f_cpu=16000000L
32PinBoard.menu.mhz.16M230.upload.speed=230400 
32PinBoard.menu.mhz.16M230.bootloader.file=myoptiboot/optiboot_atmega328_16M_230400_D8.hex

32PinBoard.menu.mhz.20M115=20Mhz - crystal - 115K2 - D8
32PinBoard.menu.mhz.20M115.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.20M115.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.20M115.build.f_cpu=20000000L
32PinBoard.menu.mhz.20M115.upload.speed=115200 
32PinBoard.menu.mhz.20M115.bootloader.file=myoptiboot/optiboot_atmega328_20M_115200_D8.hex

32PinBoard.menu.mhz.20M230=20Mhz - crystal - 230K4 - D8
32PinBoard.menu.mhz.20M230.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.20M230.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.20M230.build.f_cpu=20000000L
32PinBoard.menu.mhz.20M230.upload.speed=230400 
32PinBoard.menu.mhz.20M230.bootloader.file=myoptiboot/optiboot_atmega328_20M_230400_D8.hex

32PinBoard.menu.mhz.20M250=20Mhz - crystal - 250K - D8
32PinBoard.menu.mhz.20M250.bootloader.low_fuses=0xFF
32PinBoard.menu.mhz.20M250.bootloader.high_fuses=0xDE
32PinBoard.menu.mhz.20M250.build.f_cpu=20000000L
32PinBoard.menu.mhz.20M250.upload.speed=250000 
32PinBoard.menu.mhz.20M250.bootloader.file=myoptiboot/optiboot_atmega328_20M_250000_D8.hex


############################################################################


40PinBoard.name=atmega1284p based - 40 pin DIL

40PinBoard.upload.tool=arduino:avrdude
40PinBoard.upload.protocol=arduino
40PinBoard.upload.maximum_size=32256
40PinBoard.upload.maximum_data_size=2048

40PinBoard.bootloader.tool=arduino:avrdude
40PinBoard.bootloader.unlock_bits=0x3F
40PinBoard.bootloader.lock_bits=0x0F
40PinBoard.bootloader.high_fuses=0xDE

40PinBoard.build.core=arduino:arduino
40PinBoard.build.mcu=atmega1284p
40PinBoard.build.board=AVR_GERTSANDERS40PinBoard
40PinBoard.build.variant=40PinBoard


40PinBoard.menu.oscillator.8MHzCDIV8=1Mhz - internal 8MHz CDIV 8
40PinBoard.menu.oscillator.8MHzCDIV8.bootloader.low_fuses=0x62

40PinBoard.menu.oscillator.Internal=8MHz - internal oscillator
40PinBoard.menu.oscillator.Internal.bootloader.low_fuses=0xE2

40PinBoard.menu.oscillator.FULLSWING=Full swing crystal
40PinBoard.menu.oscillator.FULLSWING.bootloader.low_fuses=0xFF

40PinBoard.menu.bod.4v3=4V3
40PinBoard.menu.bod.4v3.bootloader.extended_fuses=0x04

40PinBoard.menu.bod.2v7=2V7
40PinBoard.menu.bod.2v7.bootloader.extended_fuses=0x05

40PinBoard.menu.bod.1v8=1V8
40PinBoard.menu.bod.1v8.bootloader.extended_fuses=0x06

40PinBoard.menu.bod.off=Disabled
40PinBoard.menu.bod.off.bootloader.extended_fuses=0x07




40PinBoard.menu.mhz.1M-4K8-NL=1Mhz - 4K8 - NO LED
40PinBoard.menu.mhz.1M-4K8-NL.build.f_cpu=1000000L
40PinBoard.menu.mhz.1M-4K8-NL.upload.speed=4800
40PinBoard.menu.mhz.1M-4K8-NL.bootloader.file=myoptiboot/optiboot_atmega1284_01M_004800_NOLED.hex

40PinBoard.menu.mhz.1M-4K8-D5=1Mhz - 4K8 - D5
40PinBoard.menu.mhz.1M-4K8-D5.build.f_cpu=1000000L
40PinBoard.menu.mhz.1M-4K8-D5.upload.speed=4800
40PinBoard.menu.mhz.1M-4K8-D5.bootloader.file=myoptiboot/optiboot_atmega1284_01M_004800_D5.hex

40PinBoard.menu.mhz.1M-4K8-D8=1Mhz - 4K8 - D8
40PinBoard.menu.mhz.1M-4K8-D8.build.f_cpu=1000000L
40PinBoard.menu.mhz.1M-4K8-D8.upload.speed=4800
40PinBoard.menu.mhz.1M-4K8-D8.bootloader.file=myoptiboot/optiboot_atmega1284_01M_004800_D8.hex

40PinBoard.menu.mhz.1M-4K8-D13=1Mhz - 4K8 - D13
40PinBoard.menu.mhz.1M-4K8-D13.build.f_cpu=1000000L
40PinBoard.menu.mhz.1M-4K8-D13.upload.speed=4800
40PinBoard.menu.mhz.1M-4K8-D13.bootloader.file=myoptiboot/optiboot_atmega1284_01M_004800_D13.hex



40PinBoard.menu.mhz.1M-9K6-D5=1Mhz - 9K6 - D5
40PinBoard.menu.mhz.1M-9K6-D5.build.f_cpu=1000000L
40PinBoard.menu.mhz.1M-9K6-D5.upload.speed=9600
40PinBoard.menu.mhz.1M-9K6-D5.bootloader.file=myoptiboot/optiboot_atmega1284_01M_009600_D5.hex

40PinBoard.menu.mhz.1M-9K6-D8=1Mhz - 9K6 - D8
40PinBoard.menu.mhz.1M-9K6-D8.build.f_cpu=1000000L
40PinBoard.menu.mhz.1M-9K6-D8.upload.speed=9600
40PinBoard.menu.mhz.1M-9K6-D8.bootloader.file=myoptiboot/optiboot_atmega1284_01M_009600_D8.hex

40PinBoard.menu.mhz.1M-9K6-D13=1Mhz - 9K6 - D13
40PinBoard.menu.mhz.1M-9K6-D13.build.f_cpu=1000000L
40PinBoard.menu.mhz.1M-9K6-D13.upload.speed=9600
40PinBoard.menu.mhz.1M-9K6-D13.bootloader.file=myoptiboot/optiboot_atmega1284_01M_009600_D13.hex



40PinBoard.menu.mhz.4M-19K2-NL=4Mhz - 19K2 - NO LED
40PinBoard.menu.mhz.4M-19K2-NL.build.f_cpu=4000000L
40PinBoard.menu.mhz.4M-19K2-NL.upload.speed=19200
40PinBoard.menu.mhz.4M-19K2-NL.bootloader.file=myoptiboot/optiboot_atmega1284_04M_019200_NOLED.hex

40PinBoard.menu.mhz.4M-19K2-D8=4Mhz - 19K2 - D8
40PinBoard.menu.mhz.4M-19K2-D8.build.f_cpu=4000000L
40PinBoard.menu.mhz.4M-19K2-D8.upload.speed=19200
40PinBoard.menu.mhz.4M-19K2-D8.bootloader.file=myoptiboot/optiboot_atmega1284_04M_019200_D8.hex



40PinBoard.menu.mhz.8M-9K6-D8=8Mhz - 9K6 - D8
40PinBoard.menu.mhz.8M-9K6-D8.build.f_cpu=8000000L
40PinBoard.menu.mhz.8M-9K6-D8.upload.speed=9600
40PinBoard.menu.mhz.8M-9K6-D8.bootloader.file=myoptiboot/optiboot_atmega1284_08M_009600_D8.hex



40PinBoard.menu.mhz.8M-38K4-NL=8Mhz - 38K4 - NO LED
40PinBoard.menu.mhz.8M-38K4-NL.build.f_cpu=8000000L
40PinBoard.menu.mhz.8M-38K4-NL.upload.speed=38400
40PinBoard.menu.mhz.8M-38K4-NL.bootloader.file=myoptiboot/optiboot_atmega1284_08M_038400_NOLED.hex

40PinBoard.menu.mhz.8M-38K4-D5=8Mhz - 38K4 - D5
40PinBoard.menu.mhz.8M-38K4-D5.build.f_cpu=8000000L
40PinBoard.menu.mhz.8M-38K4-D5.upload.speed=38400
40PinBoard.menu.mhz.8M-38K4-D5.bootloader.file=myoptiboot/optiboot_atmega1284_08M_038400_D5.hex

40PinBoard.menu.mhz.8M-38K4-D6=8Mhz - 38K4 - D6
40PinBoard.menu.mhz.8M-38K4-D6.build.f_cpu=8000000L 
40PinBoard.menu.mhz.8M-38K4-D6.upload.speed=38400
40PinBoard.menu.mhz.8M-38K4-D6.bootloader.file=myoptiboot/optiboot_atmega1284_08M_038400_D6.hex

