corhaneanusergiu/atmega328p-optiboot-various-62/atmega328p/avr/boards.txt
40PinBoard.menu.mhz.8M-38K4-D8=8Mhz - 38K4 - D8
40PinBoard.menu.mhz.8M-38K4-D8.build.f_cpu=8000000L 
40PinBoard.menu.mhz.8M-38K4-D8.upload.speed=38400
40PinBoard.menu.mhz.8M-38K4-D8.bootloader.file=myoptiboot/optiboot_atmega1284_08M_038400_D8.hex

40PinBoard.menu.mhz.8M-38K4-D13=8Mhz - 38K4 - D13
40PinBoard.menu.mhz.8M-38K4-D13.build.f_cpu=8000000L 
40PinBoard.menu.mhz.8M-38K4-D13.upload.speed=38400
40PinBoard.menu.mhz.8M-38K4-D13.bootloader.file=myoptiboot/optiboot_atmega1284_08M_038400_D13.hex



40PinBoard.menu.mhz.16M-57K-NL=16Mhz - 57K6 - NO LED
40PinBoard.menu.mhz.16M-57K-NL.build.f_cpu=16000000L
40PinBoard.menu.mhz.16M-57K-NL.upload.speed=57600
40PinBoard.menu.mhz.16M-57K-NL.bootloader.file=myoptiboot/optiboot_atmega1284_16M_057600_NOLED.hex

40PinBoard.menu.mhz.16M-57K-D5=16Mhz - 57K6 - D5
40PinBoard.menu.mhz.16M-57K-D5.build.f_cpu=16000000L
40PinBoard.menu.mhz.16M-57K-D5.upload.speed=57600
40PinBoard.menu.mhz.16M-57K-D5.bootloader.file=myoptiboot/optiboot_atmega1284_16M_057600_D5.hex

40PinBoard.menu.mhz.16M-57K-D8=16Mhz - 57K6 - D8
40PinBoard.menu.mhz.16M-57K-D8.build.f_cpu=16000000L
40PinBoard.menu.mhz.16M-57K-D8.upload.speed=57600
40PinBoard.menu.mhz.16M-57K-D8.bootloader.file=myoptiboot/optiboot_atmega1284_16M_057600_D8.hex

40PinBoard.menu.mhz.16M-57K-D13=16Mhz - 57K6 - D13
40PinBoard.menu.mhz.16M-57K-D13.build.f_cpu=16000000L
40PinBoard.menu.mhz.16M-57K-D13.upload.speed=57600
40PinBoard.menu.mhz.16M-57K-D13.bootloader.file=myoptiboot/optiboot_atmega1284_16M_057600_D13.hex



40PinBoard.menu.mhz.16M-74K-D8=16Mhz - 74K8 - D8
40PinBoard.menu.mhz.16M-74K-D8.build.f_cpu=16000000L
40PinBoard.menu.mhz.16M-74K-D8.upload.speed=74880 
40PinBoard.menu.mhz.16M-74K-D8.bootloader.file=myoptiboot/optiboot_atmega1284_16M_074880_D8.hex


40PinBoard.menu.mhz.16M-76K-D8=16Mhz - 76K8 - D8
40PinBoard.menu.mhz.16M-76K-D8.build.f_cpu=16000000L
40PinBoard.menu.mhz.16M-76K-D8.upload.speed=76800 
40PinBoard.menu.mhz.16M-76K-D8.bootloader.file=myoptiboot/optiboot_atmega1284_16M_076800_D8.hex


40PinBoard.menu.mhz.16M-115K-D8=16Mhz - 115K2 - D8
40PinBoard.menu.mhz.16M-115K-D8.build.f_cpu=16000000L
40PinBoard.menu.mhz.16M-115K-D8.upload.speed=115200 
40PinBoard.menu.mhz.16M-115K-D8.bootloader.file=myoptiboot/optiboot_atmega1284_16M_115200_D8.hex

40PinBoard.menu.mhz.16M-115K-D13=16Mhz - 115K2 - D13
40PinBoard.menu.mhz.16M-115K-D13.build.f_cpu=16000000L
40PinBoard.menu.mhz.16M-115K-D13.upload.speed=115200 
40PinBoard.menu.mhz.16M-115K-D13.bootloader.file=myoptiboot/optiboot_atmega1284_16M_115200_D13.hex



40PinBoard.menu.mhz.16M-230K-D8=16Mhz - 230K4 - D8
40PinBoard.menu.mhz.16M-230K-D8.build.f_cpu=16000000L
40PinBoard.menu.mhz.16M-230K-D8.upload.speed=230400 
40PinBoard.menu.mhz.16M-230K-D8.bootloader.file=myoptiboot/optiboot_atmega1284_16M_230400_D8.hex


40PinBoard.menu.mhz.20M-115K-D8=20Mhz - 115K2 - D8
40PinBoard.menu.mhz.20M-115K-D8.build.f_cpu=20000000L
40PinBoard.menu.mhz.20M-115K-D8.upload.speed=115200 
40PinBoard.menu.mhz.20M-115K-D8.bootloader.file=myoptiboot/optiboot_atmega1284_20M_115200_D8.hex


40PinBoard.menu.mhz.20M-230K-D8=20Mhz - 230K4 - D8
40PinBoard.menu.mhz.20M-230K-D8.build.f_cpu=20000000L
40PinBoard.menu.mhz.20M-230K-D8.upload.speed=230400 
40PinBoard.menu.mhz.20M-230K-D8.bootloader.file=myoptiboot/optiboot_atmega1284_20M_230400_D8.hex


40PinBoard.menu.mhz.20M-250K-D8=20Mhz - 250K - D8
40PinBoard.menu.mhz.20M-250K-D8.build.f_cpu=20000000L
40PinBoard.menu.mhz.20M-250K-D8.upload.speed=250000 
40PinBoard.menu.mhz.20M-250K-D8.bootloader.file=myoptiboot/optiboot_atmega1284_20M_250000_D8.hex



############################################################################



44PinBoard.name=atmega1284p based - 44 pin TQFP

44PinBoard.upload.tool=arduino:avrdude
44PinBoard.upload.protocol=arduino
44PinBoard.upload.maximum_size=32256
44PinBoard.upload.maximum_data_size=2048

44PinBoard.bootloader.tool=arduino:avrdude

44PinBoard.bootloader.unlock_bits=0x3F
44PinBoard.bootloader.lock_bits=0x0F


44PinBoard.build.core=arduino:arduino
44PinBoard.build.mcu=atmega1284p

44PinBoard.build.board=AVR_GERTSANDERS44PinBoard
44PinBoard.build.variant=44PinBoard

44PinBoard.menu.bod.4v3=4V3
44PinBoard.menu.bod.4v3.bootloader.extended_fuses=0x04
44PinBoard.menu.bod.2v7=2V7
44PinBoard.menu.bod.2v7.bootloader.extended_fuses=0x05
44PinBoard.menu.bod.1v8=1V8
44PinBoard.menu.bod.1v8.bootloader.extended_fuses=0x06
44PinBoard.menu.bod.off=Disabled
44PinBoard.menu.bod.off.bootloader.extended_fuses=0x07

44PinBoard.menu.mhz.8MiDIV8-4K8-NL= 1Mhz - internal 8MHz CDIV 8 - 4K8 - NO LED
44PinBoard.menu.mhz.8MiDIV8-4K8-NL.bootloader.low_fuses=0x62
44PinBoard.menu.mhz.8MiDIV8-4K8-NL.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8MiDIV8-4K8-NL.build.f_cpu=1000000L
44PinBoard.menu.mhz.8MiDIV8-4K8-NL.upload.speed=4800
44PinBoard.menu.mhz.8MiDIV8-4K8-NL.bootloader.file=myoptiboot/optiboot_atmega1284_01M_004800_NOLED.hex


44PinBoard.menu.mhz.8MiDIV8-4K8-D5= 1Mhz - internal 8MHz CDIV 8 - 4K8 - D5
44PinBoard.menu.mhz.8MiDIV8-4K8-D5.bootloader.low_fuses=0x62
44PinBoard.menu.mhz.8MiDIV8-4K8-D5.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8MiDIV8-4K8-D5.build.f_cpu=1000000L
44PinBoard.menu.mhz.8MiDIV8-4K8-D5.upload.speed=4800
44PinBoard.menu.mhz.8MiDIV8-4K8-D5.bootloader.file=myoptiboot/optiboot_atmega1284_01M_004800_D5.hex

44PinBoard.menu.mhz.8MiDIV8-4K8-D8= 1Mhz - internal 8MHz CDIV 8 - 4K8 - D8
44PinBoard.menu.mhz.8MiDIV8-4K8-D8.bootloader.low_fuses=0x62
44PinBoard.menu.mhz.8MiDIV8-4K8-D8.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8MiDIV8-4K8-D8.build.f_cpu=1000000L
44PinBoard.menu.mhz.8MiDIV8-4K8-D8.upload.speed=4800
44PinBoard.menu.mhz.8MiDIV8-4K8-D8.bootloader.file=myoptiboot/optiboot_atmega1284_01M_004800_D8.hex

44PinBoard.menu.mhz.8MiDIV8-4K8-D13= 1Mhz - internal 8MHz CDIV 8 - 4K8 - D13
44PinBoard.menu.mhz.8MiDIV8-4K8-D13.bootloader.low_fuses=0x62
44PinBoard.menu.mhz.8MiDIV8-4K8-D13.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8MiDIV8-4K8-D13.build.f_cpu=1000000L
44PinBoard.menu.mhz.8MiDIV8-4K8-D13.upload.speed=4800
44PinBoard.menu.mhz.8MiDIV8-4K8-D13.bootloader.file=myoptiboot/optiboot_atmega1284_01M_004800_D13.hex


44PinBoard.menu.mhz.8MiDIV8-9K6-D8= 1Mhz - internal 8MHz CDIV 8 - 9K6 - D8
44PinBoard.menu.mhz.8MiDIV8-9K6-D8.bootloader.low_fuses=0x62
44PinBoard.menu.mhz.8MiDIV8-9K6-D8.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8MiDIV8-9K6-D8.build.f_cpu=1000000L
44PinBoard.menu.mhz.8MiDIV8-9K6-D8.upload.speed=9600
44PinBoard.menu.mhz.8MiDIV8-9K6-D8.bootloader.file=myoptiboot/optiboot_atmega1284_01M_009600_D8.hex

