corhaneanusergiu/atmega328p-optiboot-various-62/atmega328p/avr/boards.txt
44PinBoard.menu.mhz.1M-9K6-D8= 1Mhz - crystal - 9K6 - D8
44PinBoard.menu.mhz.1M-9K6-D8.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.1M-9K6-D8.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.1M-9K6-D8.build.f_cpu=1000000L
44PinBoard.menu.mhz.1M-9K6-D8.upload.speed=9600
44PinBoard.menu.mhz.1M-9K6-D8.bootloader.file=myoptiboot/optiboot_atmega1284_01M_009600_D8.hex


44PinBoard.menu.mhz.4M-19K2-D8= 4Mhz - crystal - 19K2 - D8
44PinBoard.menu.mhz.4M-19K2-D8.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.4M-19K2-D8.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.4M-19K2-D8.build.f_cpu=4000000L
44PinBoard.menu.mhz.4M-19K2-D8.upload.speed=19200
44PinBoard.menu.mhz.4M-19K2-D8.bootloader.file=myoptiboot/optiboot_atmega1284_04M_019200_D8.hex

44PinBoard.menu.mhz.8Mi-9K6-D8= 8Mhz - internal - 9K6 - D8
44PinBoard.menu.mhz.8Mi-9K6-D8.bootloader.low_fuses=0xE2
44PinBoard.menu.mhz.8Mi-9K6-D8.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8Mi-9K6-D8.build.f_cpu=8000000L
44PinBoard.menu.mhz.8Mi-9K6-D8.upload.speed=9600
44PinBoard.menu.mhz.8Mi-9K6-D8.bootloader.file=myoptiboot/optiboot_atmega1284_08M_009600_D8.hex

44PinBoard.menu.mhz.8Mi-38K4-D6= 8Mhz - internal - 38K4 - D6
44PinBoard.menu.mhz.8Mi-38K4-D6.bootloader.low_fuses=0xE2
44PinBoard.menu.mhz.8Mi-38K4-D6.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8Mi-38K4-D6.build.f_cpu=8000000L 
44PinBoard.menu.mhz.8Mi-38K4-D6.upload.speed=38400
44PinBoard.menu.mhz.8Mi-38K4-D6.bootloader.file=myoptiboot/optiboot_atmega1284_08M_038400_D6.hex

44PinBoard.menu.mhz.8Mi-38K4-D8= 8Mhz - internal - 38K4 - D8
44PinBoard.menu.mhz.8Mi-38K4-D8.bootloader.low_fuses=0xE2
44PinBoard.menu.mhz.8Mi-38K4-D8.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8Mi-38K4-D8.build.f_cpu=8000000L 
44PinBoard.menu.mhz.8Mi-38K4-D8.upload.speed=38400
44PinBoard.menu.mhz.8Mi-38K4-D8.bootloader.file=myoptiboot/optiboot_atmega1284_08M_038400_D8.hex

44PinBoard.menu.mhz.8Mi-38K4-D13= 8Mhz - internal - 38K4 - D13
44PinBoard.menu.mhz.8Mi-38K4-D13.bootloader.low_fuses=0xE2
44PinBoard.menu.mhz.8Mi-38K4-D13.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8Mi-38K4-D13.build.f_cpu=8000000L 
44PinBoard.menu.mhz.8Mi-38K4-D13.upload.speed=38400
44PinBoard.menu.mhz.8Mi-38K4-D13.bootloader.file=myoptiboot/optiboot_atmega1284_08M_038400_D13.hex

44PinBoard.menu.mhz.8M-38K4-D5= 8Mhz - crystal - 38K4 - D5
44PinBoard.menu.mhz.8M-38K4-D5.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.8M-38K4-D5.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8M-38K4-D5.build.f_cpu=8000000L
44PinBoard.menu.mhz.8M-38K4-D5.upload.speed=38400
44PinBoard.menu.mhz.8M-38K4-D5.bootloader.file=myoptiboot/optiboot_atmega1284_08M_038400_D5.hex

44PinBoard.menu.mhz.8M-38K4-D6= 8Mhz - crystal - 38K4 - D6
44PinBoard.menu.mhz.8M-38K4-D6.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.8M-38K4-D6.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8M-38K4-D6.build.f_cpu=8000000L 
44PinBoard.menu.mhz.8M-38K4-D6.upload.speed=38400
44PinBoard.menu.mhz.8M-38K4-D6.bootloader.file=myoptiboot/optiboot_atmega1284_08M_038400_D6.hex

44PinBoard.menu.mhz.8M-38K4-D8= 8Mhz - crystal - 38K4 - D8
44PinBoard.menu.mhz.8M-38K4-D8.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.8M-38K4-D8.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8M-38K4-D8.build.f_cpu=8000000L 
44PinBoard.menu.mhz.8M-38K4-D8.upload.speed=38400
44PinBoard.menu.mhz.8M-38K4-D8.bootloader.file=myoptiboot/optiboot_atmega1284_08M_038400_D8.hex

44PinBoard.menu.mhz.8M-38K4-D13= 8Mhz - crystal - 38K4 - D13
44PinBoard.menu.mhz.8M-38K4-D13.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.8M-38K4-D13.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.8M-38K4-D13.build.f_cpu=8000000L 
44PinBoard.menu.mhz.8M-38K4-D13.upload.speed=38400
44PinBoard.menu.mhz.8M-38K4-D13.bootloader.file=myoptiboot/optiboot_atmega1284_08M_038400_D13.hex

44PinBoard.menu.mhz.16M57=16Mhz - crystal - 57K6 - D8
44PinBoard.menu.mhz.16M57.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.16M57.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.16M57.build.f_cpu=16000000L
44PinBoard.menu.mhz.16M57.upload.speed=57600
44PinBoard.menu.mhz.16M57.bootloader.file=myoptiboot/optiboot_atmega1284_16M_057600_D8.hex

44PinBoard.menu.mhz.16M-57K-D13=16Mhz - crystal - 57K6 - D13
44PinBoard.menu.mhz.16M-57K-D13.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.16M-57K-D13.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.16M-57K-D13.build.f_cpu=16000000L
44PinBoard.menu.mhz.16M-57K-D13.upload.speed=57600
44PinBoard.menu.mhz.16M-57K-D13.bootloader.file=myoptiboot/optiboot_atmega1284_16M_057600_D13.hex

44PinBoard.menu.mhz.16M74=16Mhz - crystal - 74K8 - D8
44PinBoard.menu.mhz.16M74.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.16M74.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.16M74.build.f_cpu=16000000L
44PinBoard.menu.mhz.16M74.upload.speed=74880 
44PinBoard.menu.mhz.16M74.bootloader.file=myoptiboot/optiboot_atmega1284_16M_074880_D8.hex

44PinBoard.menu.mhz.16M76=16Mhz - crystal - 76K8 - D8
44PinBoard.menu.mhz.16M76.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.16M76.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.16M76.build.f_cpu=16000000L
44PinBoard.menu.mhz.16M76.upload.speed=76800 
44PinBoard.menu.mhz.16M76.bootloader.file=myoptiboot/optiboot_atmega1284_16M_076800_D8.hex

44PinBoard.menu.mhz.16M115=16Mhz - crystal - 115K2 - D8
44PinBoard.menu.mhz.16M115.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.16M115.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.16M115.build.f_cpu=16000000L
44PinBoard.menu.mhz.16M115.upload.speed=115200 
44PinBoard.menu.mhz.16M115.bootloader.file=myoptiboot/optiboot_atmega1284_16M_115200_D8.hex

44PinBoard.menu.mhz.16M230=16Mhz - crystal - 230K4 - D8
44PinBoard.menu.mhz.16M230.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.16M230.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.16M230.build.f_cpu=16000000L
44PinBoard.menu.mhz.16M230.upload.speed=230400 
44PinBoard.menu.mhz.16M230.bootloader.file=myoptiboot/optiboot_atmega1284_16M_230400_D8.hex

44PinBoard.menu.mhz.20M115=20Mhz - crystal - 115K2 - D8
44PinBoard.menu.mhz.20M115.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.20M115.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.20M115.build.f_cpu=20000000L
44PinBoard.menu.mhz.20M115.upload.speed=115200 
44PinBoard.menu.mhz.20M115.bootloader.file=myoptiboot/optiboot_atmega1284_20M_115200_D8.hex

44PinBoard.menu.mhz.20M230=20Mhz - crystal - 230K4 - D8
44PinBoard.menu.mhz.20M230.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.20M230.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.20M230.build.f_cpu=20000000L
44PinBoard.menu.mhz.20M230.upload.speed=230400 
44PinBoard.menu.mhz.20M230.bootloader.file=myoptiboot/optiboot_atmega1284_20M_230400_D8.hex

44PinBoard.menu.mhz.20M250=20Mhz - crystal - 250K - D8
44PinBoard.menu.mhz.20M250.bootloader.low_fuses=0xFF
44PinBoard.menu.mhz.20M250.bootloader.high_fuses=0xDE
44PinBoard.menu.mhz.20M250.build.f_cpu=20000000L
44PinBoard.menu.mhz.20M250.upload.speed=250000 
44PinBoard.menu.mhz.20M250.bootloader.file=myoptiboot/optiboot_atmega1284_20M_250000_D8.hex
